export const foodData = [
    {
        "index": 1,
        "recipeName": "김치볶음밥",
        "ingredients": [
            "밥 2공기",
            "김치 1컵",
            "돼지고기 150g",
            "양파 1개",
            "달걀 2개",
            "식용유 2큰술",
            "간장 2큰술",
            "참기름 1큰술",
            "김치 국물 3큰술",
            "소금과 후추",
        ],
        "instructions": [
            "김치와 돼지고기를 채 썰어 볶아줍니다.",
            "양파를 다져 넣고 볶아줍니다.",
            "밥을 넣고 잘 섞어가며 볶아줍니다.",
            "간장, 김치 국물, 소금, 후추를 넣고 볶아줍니다.",
            "달걀을 풀어 넣고 볶아줍니다.",
            "참기름을 넣고 볶아준 후 완성!"
        ]
    },
    {
        "index": 2,
        "recipeName": "된장찌개",
        "ingredients": [
            "두부",
            "마늘 3쪽",
            "양파 1개",
            "청양고추 2개",
            "무 1/4개",
            "된장 2큰술",
            "고춧가루 1큰술",
            "소금과 국간장 약간",
            "물 4컵"
        ],
        "instructions": [
            "두부를 썰어 물에 담가 불순물을 뺍니다.",
            "무는 반투명해질 때까지 살짝 데쳐줍니다.",
            "된장과 고춧가루를 물에 풀어 넣고 끓입니다.",
            "마지막에 두부, 양파, 청양고추를 넣고 간을 맞추어 완성!"
        ]
    },
    {
        "index": 3,
        "recipeName": "불고기",
        "ingredients": [
            {
                "재료": "불고기용 소고기",
                "양": "500g"
            },
            {
                "재료": "배즙",
                "양": "4큰술"
            },
            {
                "재료": "간장",
                "양": "4큰술"
            },
            {
                "재료": "물엿",
                "양": "2큰술"
            },
            {
                "재료": "설탕",
                "양": "2큰술"
            },
            {
                "재료": "다진 파",
                "양": "2큰술"
            },
            {
                "재료": "다진 마늘",
                "양": "1큰술"
            },
            {
                "재료": "깨소금",
                "양": "1큰술"
            },
            {
                "재료": "참기름",
                "양": "1큰술"
            },
            {
                "재료": "후춧가루",
                "양": "약간"
            },
            {
                "재료": "양파",
                "양": "1개"
            }
        ],
        "instructions": [
            "소고기를 얇게 썰어 준비합니다.",
            "양념 재료를 섞어 양념을 만듭니다.",
            "소고기를 양념에 넣고 무칩니다.",
            "양파는 얇게 썰어 소고기 위에 얹어 준비합니다.",
            "팬에서 양념한 소고기를 볶아 완성!"
        ]
    },
    {
        "index": 4,
        "recipeName": "스파게티",
        "ingredients": [
            {
                "재료": "파스타",
                "양": "200g"
            },
            {
                "재료": "스파게티 소스",
                "양": "1병"
            },
            {
                "재료": "양파",
                "양": "1개"
            },
            {
                "재료": "마늘",
                "양": "2쪽"
            },
            {
                "재료": "올리브 오일",
                "양": "2큰술"
            },
            {
                "재료": "소금과 후추",
                "양": "약간"
            },
            {
                "재료": "파슬리",
                "양": "적당량"
            }
        ],
        "instructions": [
            "파스타를 끓는 물에 삶습니다.",
            "양파와 마늘을 다져 볶아 스파게티 소스에 더합니다.",
            "올리브 오일을 데워 소스에 넣습니다.",
            "삶은 파스타를 소스와 함께 볶아 완성합니다.",
            "소금과 후추로 간을 맞추고 파슬리로 마무리합니다."
        ]
    },
    {
        "index": 5,
        "recipeName": "오믈렛",
        "ingredients": [
            {
                "재료": "계란",
                "양": "3개"
            },
            {
                "재료": "우유",
                "양": "3큰술"
            },
            {
                "재료": "소금과 후추",
                "양": "약간"
            },
            {
                "재료": "양파",
                "양": "1/4개"
            },
            {
                "재료": "베이컨",
                "양": "2조각"
            },
            {
                "재료": "치즈",
                "양": "1/4컵"
            },
            {
                "재료": "식용유",
                "양": "적당량"
            }
        ],
        "instructions": [
            "계란을 풀어 우유와 소금, 후추로 풍미를 낸 후 섞습니다.",
            "양파와 베이컨을 다져 준비합니다.",
            "프라이팬에 식용유를 두르고 준비한 재료를 볶아냅니다.",
            "계란을 부어 팬 전체에 고루 퍼지도록 합니다.",
            "치즈를 올리고 접어 반쯤 익혀 뒤집어 완성합니다."
        ]
    }
]  
